app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-02-20 20:14:12.639081"], ["updated_at", "2021-02-20 20:14:12.639081"]]
---
  def create
    # raise params.inspect
    # from raising params we see the form tag helper
    # does not create a model key where attributes
    # will be stored as keys and there values
    # as values to their corresponding key

    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-02-20 20:14:12.741417"], ["id", 1]]
---
  def update
    # raise params.inspect
    # raise method will cause the application to pause and print
    # out the params on an error page. you could also see
    # the params if you called puts params.inspect
    # using puts would simply require you to track down
    # the data in the rails server log
    @article = Article.find(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])